In [28]:
import pandas as pd
import numpy as np
import pymysql
from sqlalchemy import create_engine, text
import getpass  # To get the password without showing the input

In [29]:
#Create a Python connection with SQL database
password = getpass.getpass()
connection_string = 'mysql+pymysql://root:'+password+'@localhost/sakila'
engine = create_engine(connection_string)

········

In [30]:
#How many distinct (different) actors' last names are there?

data_actor = pd.read_sql_query('select count(distinct(last_name)) as distinc_last_names from actor;', engine)
data_actor

   distinc_last_names
0                 121

In [31]:
#Add an additional column day_type with values 'weekend' and 'workday' depending on the rental day of the week.

data_rental_date = pd.read_sql_query('''select *,
if (weekday(left(rental_date,10)) in (5,6), 'weekend', 'workday') as 'day_type'
from rental;''',engine)
data_rental_date

,rental_id,rental_date,inventory_id,customer_id,return_date,staff_id,last_update,day_type
0,1,2005-05-24 22:53:30,367,130,2005-05-26 22:04:30,1,2006-02-15 21:30:53,workday
1,2,2005-05-24 22:54:33,1525,459,2005-05-28 19:40:33,1,2006-02-15 21:30:53,workday
2,3,2005-05-24 23:03:39,1711,408,2005-06-01 22:12:39,1,2006-02-15 21:30:53,workday
3,4,2005-05-24 23:04:41,2452,333,2005-06-03 01:43:41,2,2006-02-15 21:30:53,workday
4,5,2005-05-24 23:05:21,2079,222,2005-06-02 04:33:21,1,2006-02-15 21:30:53,workday
...,...,...,...,...,...,...,...,...
16039,16045,2005-08-23 22:25:26,772,14,2005-08-25 23:54:26,1,2006-02-15 21:30:53,workday
16040,16046,2005-08-23 22:26:47,4364,74,2005-08-27 18:02:47,2,2006-02-15 21:30:53,workday
16041,16047,2005-08-23 22:42:48,2088,114,2005-08-25 02:48:48,2,2006-02-15 21:30:53,workday
16042,16048,2005-08-23 22:43:07,2019,103,2005-08-31 21:33:07,1,2006-02-15 21:30:53,workday
16043,16049,2005-08-23 22:50:12,2666,393,2005-08-30 01:01:12,2,2006-02-15 21:30:53,workday

In [32]:
#Get all films with ARMAGEDDON in the title.
query = text('''select title from film
where title like '%ARMAGEDDON%';''')
data_film = pd.read_sql_query(query,engine)
data_film

                   title
0        ARMAGEDDON LOST
1    LADYBUGS ARMAGEDDON
2       METAL ARMAGEDDON
3    MOSQUITO ARMAGEDDON
4  STAGECOACH ARMAGEDDON
5      STEERS ARMAGEDDON

In [33]:
# Get 10 the longest films.

query = text('''select title, length from film
order by length desc
limit 10;''')
data_longest_film = pd.read_sql_query(query,engine)
data_longest_film

                title  length
0      DARN FORRESTER     185
1        POND SEATTLE     185
2       CHICAGO NORTH     185
3       MUSCLE BRIGHT     185
4        WORST BANGER     185
5         GANGS PRIDE     185
6  SOLDIERS EVOLUTION     185
7           HOME PITY     185
8   SWEET BROTHERHOOD     185
9      CONTROL ANTHEM     185

In [34]:
# How many films include Behind the Scenes content?

query = text('''select count(special_features) from film
where special_features like '%Behind the scenes%';''')
data_behind_the_scenes = pd.read_sql_query(query,engine)
data_behind_the_scenes

   count(special_features)
0                      538

In [35]:
# Which kind of movies (rating) have a mean duration of more than two hours?

query = text('''select rating, avg(length) as 'duration' from film
group by rating
having avg(length) >120;''')
data_movie_2h = pd.read_sql_query(query,engine)
data_movie_2h

  rating  duration
0  PG-13  120.4439

In [36]:
# Rank films by length (filter out the rows that have nulls or 0s in length column). 
# In your output, only select the columns title, length, and the rank.

query = text('''select title, length,
dense_rank() OVER (ORDER BY length desc) as 'Rank_Ranking'
from film
where length is not null or length !=0;''')
data_movie_length = pd.read_sql_query(query,engine)
data_movie_length

                   title  length  Rank_Ranking
0          CHICAGO NORTH     185             1
1         CONTROL ANTHEM     185             1
2         DARN FORRESTER     185             1
3            GANGS PRIDE     185             1
4              HOME PITY     185             1
..                   ...     ...           ...
995         ALIEN CENTER      46           140
996            IRON MOON      46           140
997        KWAI HOMEWARD      46           140
998     LABYRINTH LEAGUE      46           140
999  RIDGEMONT SUBMARINE      46           140

[1000 rows x 3 columns]